Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 80000, 128)        590336    
_________________________________________________________________
lstm_1 (LSTM)                (None, 64)                49408     
_________________________________________________________________
repeat_vector (RepeatVector) (None, 80000, 64)         0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 80000, 64)         33024     
_________________________________________________________________
lstm_3 (LSTM)                (None, 80000, 128)        98816     
_________________________________________________________________
time_distributed (TimeDistri (None, 80000, 1024)       132096    
=================================================================
Total params: 903,680
Trainable params: 903,680
Non-trainable params: 0